Repository: sumbang/cookbook_ia
Catalog: lib/l10n/app_*.arb
Languages: fr

# app_title
source: Welcome to CookBook IA
fr: Bienvenue sur CookBook IA

# main_title
source: YOUR CULINARY ASSISTANT
fr: VOTRE ASSISTANT CULINAIRE

# txt_login
source: Sign In
fr: Se connecter

# txt_signup
source: Sign Up
fr: S'enregistrer

# txt_email
source: Email address
fr: Adresse email

# txt_pwd
source: Password
fr: Mot de passe

# txt_pwd_new
source: New password
fr: Nouveau mot de passe

# txt_reset_pwd
source: Forgot your password?
fr: Mot de passe oublié ?

# txt_name
source: Full name
fr: Nom complet

# txt_bt_signin
source: Open my session
fr: Ouvrir ma session

# txt_bt_signup
source: Create my account
fr: Créer mon compte

# txt_error_email
source: Email address required
fr: Adresse email obligatoire

# txt_error_pwd
source: Password required
fr: Mot de passe obligatoire

# txt_error_name
source: Full name required
fr: Nom complet obligatoire

# txt_error
source: Oops! An error occurred.
fr: Oups! une erreur est survenue.

# txt_no_internet
source: Please connect to the internet!!
fr: Veuillez vous connecter à internet !!

# txt_reset_screen
source: Please enter your email address, you will receive a reset link by email.
fr: Veuillez entrer votre adresse email, vous recevrez un lien de réinitialisation par mail.

# txt_init_code
source: Reset code
fr: Code de réinitialisation

# txt_next
source: Continue
fr: Continuer

# txt_change_pwd
source: Change my password
fr: Changer mon mot de passe

# txt_menu1
source: History
fr: Historique

# txt_menu2
source: Recordings
fr: Enregistrements

# txt_menu3
source: My account
fr: Mon compte

# txt_menu31
source: My information
fr: Mes informations

# txt_menu32
source: My allergies
fr: Mes allergies

# txt_menu33
source: My preferences
fr: Mes préférences

# txt_menu4
source: About the application
fr: A propos de l'application

# txt_menu5
source: Disconnect
fr: Déconnexion

# txt_menu7
source: Apps version
fr: Version de l'application

# txt_welcome
source: Welcome user, what can i do for you today ?
fr: Bienvenue user, que puis-je faire pour toi aujourd'hui ?

# txt_bloc1
source: Find a recipe
fr: Trouver une recette

# txt_bloc11
source: Take a photo of a dish and we'll give you the recipe to make it.
fr: Prener une photo d'un plat et nous vous donnerons la recette pour le faire.

# txt_bloc2
source: Request recipes
fr: Demander des recettes

# txt_bloc21
source: Enter a list of ingredients and we will suggest cooking recipes.
fr: Entrer une liste d'ingrédients et nous vous proposerons des recettes de cuisine.

# txt_bloc22
source: Enter your ingredients here, separated by a comma
fr: Saisir vos ingrédients ici, séparé par une virgule

# txt_bloc3
source: Search for allergies
fr: Recherche d'allergies

# txt_bloc31
source: Take a photo of a dish and we will give you an allergy probability.
fr: Prener une photo d'un plat et vous donnerons une probabilité d'allergie.

# txt_bloc4
source: Suggest a recipe
fr: Proposer une recette

# txt_bloc41
source: You don't know what to prepare? Tell us what you want and we will provide you with the appropriate recipes
fr: Vous ne savez quoi préparer ? Dites-nous de quoi vous avez envie et nous vous fournirons les recettes adaptées

# txt_bloc42
source: Describe your desires here
fr: Décriver ici vos envies

# photo_place
source: Where would you like to take the photo?
fr: Ou souhaitez-vous prendre la photo ?

# photo_place1
source: Photo gallery
fr: Gallerie photos

# photo_place2
source: Camera
fr: Appareil photo

# txt_bt_search
source: Generate
fr: Générer

# txt_search
source: Search
fr: Rechercher

# photo1_title
source: Take photo via?
fr: Prendre la photo via ?

# photo2_title
source: Photo gallery
fr: Gallerie photo

# cancel_title
source: Close
fr: Fermer

# photo3_title
source: Camera
fr: Appareil photo

# pic_1
source: Upload your image
fr: Téléchargez votre image

# pic_2
source: You can only select one image
fr: Vous ne pouvez selectionner qu'une image

# pic_21
source: You can only select one file
fr: Vous ne pouvez selectionner qu'un fichier

# pic_3
source: Delete
fr: Supprimer

# pic_4
source: 1 File selected
fr: 1 Fichier sélectionné

# txt_wait
source: Generation in progress...
fr: Génération en cours...

# empty_txt
source: Please fill in the required fields
fr: Veuillez renseigner les champs requis

# wait_title
source: Processing...
fr: Traitement...

# email_exist
source: Account already exist with this email
fr: Un compte existe déjà avec cette adresse email

# email_invalid
source: Invalid adresse email
fr: Adresse email invalide

# app_error
source: An error occured, please retry
fr: Une erreur est survenue, veuillez recommencer

# account_create
source: Account create successfully
fr: Compte crée avec succès

# weak_password
source: The password provided is too weak
fr: Le mot de passe est très faible

# user_disabled
source: Account disabled
fr: Compte désactivé

source: User not found
fr: Utilisateur non trouvé

# reset_sent
source: Operation successful. A password reset email has been sent to you
fr: Mail de réinitialisation du mot de passe envoyé

source: Invalid credential
fr: Login ou mot de passe incorrect

# email_verified
source: Your account is not yet validated, we have just sent you a validation link
fr: Votre compte n'est pas encore validé, nous venons de vous renvoyer un lien de validation

# user_signout
source: Logout successfull
fr: Déconnexion réussie

# logout_title
source: Logout
fr: Déconnexion

# logout_desc
source: Are you sure you want to log out?
fr: Voulez-vous vraiment vous déconnecter ?

# logout_op1
source: Yes
fr: Oui

# logout_op2
source: No
fr: Non

# txt_context
source: Enter your details here
fr: Saisir vos précisions ici

# txt_alergies
source: List of your food allergies
fr: Liste de vos allergies alimentaires

# txt_gastro
source: List of your gastronomic preferences, eg: African cuisine...
fr: Votre préférence gastronomique

# txt_save
source: Operation successful
fr: Opération réussie

# txt_cuisine1
source: Asian cuisine
fr: Cuisine asiatique

# txt_cuisine2
source: European cuisine
fr: Cuisine européenne

# txt_cuisine3
source: African cuisine
fr: Cuisine africaine

# txt_cuisine4
source: South American cuisine
fr: Cuisine sud-américaine

# txt_cuisine5
source: North American cuisine
fr: Cuisine nord-américaine

# txt_cuisine6
source: Middle Eastern cuisine
fr: Cuisine du Moyen-Orient

# txt_cuisine7
source: Oceanian cuisine
fr: Cuisine océanienne

# txt_bt_save
source: Save
fr: Enregistrer

# txt_prompt1
source: Identify the cooking dish in the image and generate the cooking recipe to make it.
fr: Identifie le plat de cuisine dans l'image et génère la recette de cuisine pour réaliser cela.

# txt_prompt_content1
source: Imagine that you are guiding a cook through the steps of preparing a dish. Give the name of the dish, then break down each cooking step in detail, starting with the ingredients needed and explaining the cooking techniques , for example: 'Mix 250 g of flour with 2 eggs and 200 ml of milk to prepare the pancake batter.' If the image provided does not correspond to a cooking dish, produce a response like: 'I am.' an AI for cooking recipes, please provide an image of a cooking dish.'. Your response must be a valid Json with the following properties: If you are unable to provide recipes, a message property that will contain your response, a status property that will have a value of 2, a content property that will be an empty array. If you need more details, a message property that will contain your response, a status property that will have a value of 3, a content property that will be an empty array. If you are able to provide recipes, a status property with a value of 1, a message property that will be empty and a content property that will be an array containing the recipes that you have generated, the recipe being an element of the array with the following properties: a name property for the name of the recipe, an ingredients property that will be an array with all the ingredients, an instructions property that will be an array with all the instructions to make the recipe.
fr: Imagine que tu guides un cuisinier à travers les étapes de préparation d'un plat.Donne le nom du plat, ensuite décompose chaque étape de cuisson en détails, en commençant par les ingrédients nécessaires et en expliquant les techniques de cuisson, par exemple : 'Mélangez 250 g de farine avec 2 œufs et 200 ml de lait pour préparer la pâte à crêpes.'. Si l'image fournit ne correspond pas a un plat de cuisine, produit une reponse du style : 'Je suis une IA pour les recettes de cuisine, veuillez fournir une image d'un plat de cuisine.'. Ta réponse devra être un Json valide avec les propriétées suivantes : Si tu ne parviens pas à fournir des recettes une propriété message qui contiendra ta réponse, une propriété status qui aura pour valeur 2, une propriété content qui sera un tableau vide. Si tu as besoin de plus de précisions une propriété message qui contiendra ta réponse, une propriété status qui aura pour valeur 3, une propriété content qui sera un tableau vide. Si tu parviens à fournir les recettes, une propriété status avec pour valeur 1, une propriété message qui sera vide et une propriété content qui sera un tableau contenant la des recette que tu auras généré, la recette étant un élément du tableau avec les propriétés suivantes : une propriété name pour le nom de la recette, une propriété ingredients qui sera un tableau avec l'ensemble des incrédients, une propriété instructions qui sera un tableau avec l'ensemble des instructions pour réaliser la recette.

# txt_prompt2
source: Based on the following ingredients: @param_ingredient; provide me with cooking recipes, a maximum of 5 recipes. Consider that I have a preference for @favorite_food and that I have allergies to the following foods: @param_allergie
fr: A base des ingrédients suivant : @param_ingredient; propose moi des recettes de cuisine, un maximum de 5 recettes. Prend en considération que j'ai une préférence pour @favorite_food et que j'ai des allergies aux aliments suivants : @param_allergie

# txt_prompt_content2
source: Imagine that you guide a cook to find cooking recipes. You receive a list of ingredients separated by commas, you analyze them and then you suggest different recipes that can be made with them. You You don't have to only use the ingredients offered to you, you can just use some of them and complete with others to generate your recipes in detail, starting with the ingredients. necessary and explaining the cooking techniques, for example: 'Mix 250 g of flour with 2 eggs and 200 ml of milk to prepare the pancake batter.' used for cooking, produces a response like: 'I am an AI for cooking recipes, please provide ingredients for a recipe.'. Your response must be a valid Json with the following properties: If you are unable to provide recipes, a message property that will contain your response, a status property that will have a value of 2, a content property that will be an empty array. If you need more details, a message property that will contain your response, a status property that will have a value of 3, a content property that will be an empty array. If you are able to provide the recipes, a status property with a value of 1, a message property that will have an empty value and a content property that will be an array containing all the recipes that you have generated, each recipe being an element of the array with the following properties: a name property for the name of the recipe, an ingredients property that will be an array with all the ingredients, an instructions property that will be an array with all the instructions to make the recipe.
fr: Imagine que tu guides un cuisinier à trouver des recettes de cuisine. Tu reçois une liste d'ingrédients séparés par des virgules, tu les analyse et par après tu proposes différente recettes que l'on peut faire avec eux. Tu n'es pas obligé d'utiliser uniquement les ingrédients que l'on te proprose, tu peux juste utiliser quelque uns parmis et compléter avec d'autres afin de générer tes recettes. Décompose chaque étape de cuisson en détails, en commençant par les ingrédients nécessaires et en expliquant les techniques de cuisson, par exemple : 'Mélangez 250 g de farine avec 2 œufs et 200 ml de lait pour préparer la pâte à crêpes.'. Si parmi les ingrédients, il y a en a un qui ne peut être utilisé pour de la cuisine, produit une reponse du style : 'Je suis une IA pour les recettes de cuisine, veuillez fournir des ingrédients pour une recette.' Ta réponse devra être un Json valide avec les propriétées suivantes : Si tu ne parviens pas à fournir des recettes une propriété message qui contiendra ta réponse, une propriété status qui aura pour valeur 2, une propriété content qui sera un tableau vide. Si tu as besoin de plus de précisions une propriété message qui contiendra ta réponse, une propriété status qui aura pour valeur 3, une propriété content qui sera un tableau vide. Si tu parviens à fournir les recettes, une propriété status avec pour valeur 1, une propriété message qui aura une valeur vide et une propriété content qui sera un tableau contenant l'ensemble des recettes que tu auras généré, chaque recette étant un élément du tableau avec les propriétés suivantes : une propriété name pour le nom de la recette, une propriété ingredients qui sera un tableau avec l'ensemble des incrédients, une propriété instructions qui sera un tableau avec l'ensemble des instructions pour réaliser la recette.

# txt_prompt3
source: Identify the cooking dish in the image and tell me if there are any risks for me. I am allergic to the following foods: @param_allergie
fr: Identifie le plat de cuisine dans l'image et dis moi s'il y a des risques pour moi. Je suis allergique aux aliments suivants : @param_allergie

# txt_prompt_content3
source: Imagine telling a person if there is a risk that he or she is allergic to a food or not. Each time you receive a photo, you will have to analyze the image and detect the dish in question , on the basis of the allergies that will be given to you, you will have to be able to say whether the dish that you have been given presents any risks and highlight the allergies in question. You will have to do a probability calculation, if there are any. a probability of at least 30% of the appearance of an allergy you must report In the case where the dish does not present any allergy, you must say an answer like 'the dish is healthy for you', otherwise you must. have answers like: 'there is x% probability that this dish contains peanuts for example or x is the probability rate' If the image provided does not correspond to a cooking dish, produces an answer. like: 'I am an AI for cooking recipes, please provide an image of a cooking dish. Your answer must be a valid Json with the following properties: If you cannot find an allergy, a message property that will contain your answer, a status property that will have a value of 2, a content property that will be an empty array. If you need more details, a message property that will contain your answer, a status property that will have a value of 3, a content property that will be an empty array. If you manage to find an allergy, a status property with a value of 1, a message property will have an empty value and a content property that will be an array containing all the allergies that you have found, each allergy being an element of the array with the following properties: a name property for the allergy, a percent property that will be the probability rate of the allergy.
fr: Imagine dire a une personne s'il y a des risques qu'il soit allergique à un aliment ou pas. Chaque fois que tu recevras une photo, tu devras anyliser l'image et detecter le plat dont il est question, sur la base des allergies qui te seront donnée, tu devras pouvoir affirmer si le plat que l'on a t'a donné présente des risques et ressortir les allergies en question. Tu devras faire un calcul de probabilité, s'il y a une probabilité d'au moins 30% de l'apparition d'une allergie tu dois signaler. Dans le cas ou le plat ne présente aucune allergie, tu dois dire une réponse du style 'le plat est sain pour vous', sinon tu dois avoir des reponses du genre : ' il y a x% de probabilités que ce plat contiennes de l'arachide par exemple ou x est le taux de probabilité'. Si l'image fournit ne correspond pas a un plat de cuisine, produit une reponse du style : 'Je suis une IA pour les recettes de cuisine, veuillez fournir une image d'un plat de cuisine. Ta réponse devra être un Json valide avec les propriétées suivantes : Si tu ne parviens pas à trouver une allergue, une propriété message qui contiendra ta réponse, une propriété status qui aura pour valeur 2, une propriété content qui sera un tableau vide. Si tu as besoin de plus de précisions une propriété message qui contiendra ta réponse, une propriété status qui aura pour valeur 3, une propriété content qui sera un tableau vide. Si tu parviens à trouver une allergie, une propriété status avec pour valeur 1, une propriété message aura une valeur vide et une propriété content qui sera un tableau contenant l'ensemble des allergies que tu auras trouvé, chaque allergie étant un élément du tableau avec les propriétés suivantes : une propriété name pour l'allergie, une propriété percent qui sera le taux de probabilité de l'allergie.

# txt_prompt4
source: Identifies the wish that is made here: @param_souhait and suggests recipes that go in this direction, a maximum of 5 recipes. Consider that I have a preference for @favorite_food and that I have allergies to the following foods: @param_allergie
fr: Identifie le souhait qui est fait ici : @param_souhait et propose des recettes qui vont dans ce sens, un maximum de 5 recettes. Prend en considération que j'ai une préférence pour @favorite_food et que j'ai des allergies aux aliments suivants : @param_allergie

# txt_prompt_content4
source: Imagine that you guide a person to cook, based on an idea of ​​what the person wants to eat, you must generate cooking recipes. For each recipe, breaks down each cooking step in detail, starting with the ingredients needed and explaining cooking techniques, for example: 'Mix 250 g of flour with 2 eggs and 200 ml of milk to prepare the pancake batter.' If the idea submitted is not related to the generation of cooking recipes, produce a response like: 'I am an AI for cooking recipes, please provide foods for a recipe.'. Your response must be a valid Json with the following properties: If you are unable to provide recipes, a message property that will contain your response, a status property that will have a value of 2, a content property that will be an empty array. If you need more details, a message property that will contain your response, a status property that will have a value of 3, a content property that will be an empty array. If you are able to provide the recipes, a status property with a value of 1, a message property that will have an empty value and a content property that will be an array containing all the recipes that you have generated, each recipe being an element of the array with the following properties: a name property for the name of the recipe, an ingredients property that will be an array with all the ingredients, an instructions property that will be an array with all the instructions to make the recipe.
fr: Imagine que tu guides une personne a faire de la cuisson, sur la base d'une idée de ce que la personne souhaite manger, tu dois générer des recettes de cuisines. Pour chaque recette, décompose chaque étape de cuisson en détails, en commençant par les ingrédients nécessaires et en expliquant les techniques de cuisson, par exemple : 'Mélangez 250 g de farine avec 2 œufs et 200 ml de lait pour préparer la pâte à crêpes.'. Si l'idée soumise n'est pas en rapport avec la génération de recettes de cuisine, produit une reponse du style : 'Je suis une IA pour les recettes de cuisine, veuillez fournir des aliments pour une recette.' . Ta réponse devra être un Json valide avec les propriétées suivantes : Si tu ne parviens pas à fournir des recettes une propriété message qui contiendra ta réponse, une propriété status qui aura pour valeur 2, un propriété content qui sera un tableau vide. Si tu as besoin de plus de précisions une propriété message qui contiendra ta réponse, une propriété status qui aura pour valeur 3, une propriété content qui sera un tableau vide. Si tu parviens à fournir les recettes, une propriété status avec pour valeur 1, une propriété message qui aura une valeur vide et une propriété content qui sera un tableau contenant l'ensemble des recettes que tu auras généré, chaque recette étant un élément du tableau avec les propriétés suivantes : une propriété name pour le nom de la recette, une propriété ingredients qui sera un tableau avec l'ensemble des incrédients, une propriété instructions qui sera un tableau avec l'ensemble des instructions pour réaliser la recette.

# txt_recipe1
source: Ingredients
fr: Ingrédients

# txt_backup
source: Save
fr: Enregistrer

# txt_share
source: Share
fr: Partager

# txt_close
source: Are you sure you want to leave this page ?
fr: Voulez-vous vraiment quitter cette page ?

# txt_prob
source: Probability of presence :
fr: Probalité de présence :
